Documents/ОткрытиеЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОткрытиеЛицевогоСчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛицевыеСчета</xr:Item>
				<xr:Item>InformationRegister.ДополнительныеРеквизитыЛицевогоСчета</xr:Item>
				<xr:Item>InformationRegister.ОтветственныйВладелецЛицевогоСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОткрытиеЛицевогоСчета/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаОткрытиеЛицевогоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ОткрытиеЛицевогоСчета.ЛицевойСчет,
	 |	ОткрытиеЛицевогоСчета.Дата КАК Период,
	 |	ИСТИНА КАК Действует,
	 |	ОткрытиеЛицевогоСчета.КоличествоПрописанных,
	 |	ОткрытиеЛицевогоСчета.КоличествоПроживающих
	 |ИЗ
	 |	Документ.ОткрытиеЛицевогоСчета КАК ОткрытиеЛицевогоСчета
	 |ГДЕ
	 |	ОткрытиеЛицевогоСчета.Ссылка = &Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ОткрытиеЛицевогоСчета.Дата КАК Период,
	 |	ОткрытиеЛицевогоСчета.ЛицевойСчет,
	 |	ОткрытиеЛицевогоСчета.ОтветственныйВладелец
	 |ИЗ
	 |	Документ.ОткрытиеЛицевогоСчета КАК ОткрытиеЛицевогоСчета
	 |ГДЕ
	 |	ОткрытиеЛицевогоСчета.Ссылка = &Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.Ссылка.Дата КАК Период,
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.Ссылка.ЛицевойСчет,
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.ДополнительныйРеквизит,
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.Значение
	 |ИЗ
	 |	Документ.ОткрытиеЛицевогоСчета.ДополнительныеРеквизиты КАК ОткрытиеЛицевогоСчетаДополнительныеРеквизиты
	 |ГДЕ
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОткрытиеЛицевогоСчета);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЛицевыеСчета", МассивРезультатов[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтветственныйВладелецЛицевогоСчета", МассивРезультатов[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеРеквизитыЛицевогоСчета", МассивРезультатов[2].Выгрузить());
	
КонецПроцедуры
